In [31]:
#learning a few libraries, then you can read documentation and use the rest.
#creating dataframe from list of tuples.

import pandas as pd
record= [(23,'alison','new york'),
         (45,'john','california'),
         (36,'beth','beijing'),
         (67,'dave','london'),
         (12,'stacy','paris'),
        (30,'sam','toronto'),
        (16,'tom','las vegas')]
       
df= pd.DataFrame(record, columns=['age','name','home city'])
df

   age    name   home city
0   23  alison    new york
1   45    john  california
2   36    beth     beijing
3   67    dave      london
4   12   stacy       paris
5   30     sam     toronto
6   16     tom   las vegas

In [32]:
df.shape

(7, 3)

In [33]:
df.head(3)   #prints first 3 rows
#use shift+tab for docstring

   age    name   home city
0   23  alison    new york
1   45    john  california
2   36    beth     beijing

In [34]:
df.head() #prints first 5 rows by default

   age    name   home city
0   23  alison    new york
1   45    john  california
2   36    beth     beijing
3   67    dave      london
4   12   stacy       paris

In [35]:
df.head(-3)  #prints all except last 3 rows

   age    name   home city
0   23  alison    new york
1   45    john  california
2   36    beth     beijing
3   67    dave      london

In [36]:
df.tail(3)

   age   name  home city
4   12  stacy      paris
5   30    sam    toronto
6   16    tom  las vegas

In [37]:
df.tail()

   age   name  home city
2   36   beth    beijing
3   67   dave     london
4   12  stacy      paris
5   30    sam    toronto
6   16    tom  las vegas

In [38]:
df.tail(-2) #prints all except the first 2 rows

   age   name  home city
2   36   beth    beijing
3   67   dave     london
4   12  stacy      paris
5   30    sam    toronto
6   16    tom  las vegas

In [39]:
df.columns

Index(['age', 'name', 'home city'], dtype='object')

In [40]:
df.age #prints that column

0    23
1    45
2    36
3    67
4    12
5    30
6    16
Name: age, dtype: int64

In [41]:
df.name

0    alison
1      john
2      beth
3      dave
4     stacy
5       sam
6       tom
Name: name, dtype: object

In [42]:
df.home city #space in the column name is causing issues.

SyntaxError: invalid syntax (Temp/ipykernel_30280/849496857.py, line 1)

In [43]:
#alternate method
df['home city']

0      new york
1    california
2       beijing
3        london
4         paris
5       toronto
6     las vegas
Name: home city, dtype: object

In [44]:
df[df.age==df.age.max()] #prints the row corresponding to max age. Also make a habit of reading docstrings.

   age  name home city
3   67  dave    london

In [56]:
df.name[df.age==df.age.max()]

d    dave
Name: name, dtype: object

In [47]:
df=pd.DataFrame(record,index=[2]*7,columns=['age','name','home city'])
df

   age    name   home city
2   23  alison    new york
2   45    john  california
2   36    beth     beijing
2   67    dave      london
2   12   stacy       paris
2   30     sam     toronto
2   16     tom   las vegas

In [48]:
df=pd.DataFrame(record,index=['a','b','c','d','e','f','g'],columns=['age','name','home city'])
df

   age    name   home city
a   23  alison    new york
b   45    john  california
c   36    beth     beijing
d   67    dave      london
e   12   stacy       paris
f   30     sam     toronto
g   16     tom   las vegas

In [55]:
type(df) #remember-columns in dataframes are called 'Series'.

pandas.core.frame.DataFrame

In [58]:
a='A B C DE RT Y U I OP'
a.split()

['A', 'B', 'C', 'DE', 'RT', 'Y', 'U', 'I', 'OP']

In [60]:
df.drop(['c','f'])   #rows=axis,columns=series.

   age    name   home city
a   23  alison    new york
b   45    john  california
d   67    dave      london
e   12   stacy       paris
g   16     tom   las vegas

In [61]:
df # REMEMBER- drop is just for erasing rows temporarily.

   age    name   home city
a   23  alison    new york
b   45    john  california
c   36    beth     beijing
d   67    dave      london
e   12   stacy       paris
f   30     sam     toronto
g   16     tom   las vegas

In [ ]:
# for permanent deletion, the inplce parameter has to be set to True.
df.drop('c',inplace=True) 
#notice that it doesn't give any output. but it has performed the deletion. 
#now when you call the df, it will appear without row 'c.'

In [66]:
df

   age    name   home city
a   23  alison    new york
b   45    john  california
d   67    dave      london
e   12   stacy       paris
f   30     sam     toronto
g   16     tom   las vegas

In [75]:
df2= pd.read_csv('marks.csv')
df2    #CSV=comma separated value file.

    Name   Maths   Physics   Chemistry   English   Biology
0   Anna      87        99          54        40        93
1    Bob     100        45          56        78        23
2  Clare      34        46          76        88        12
3   Dave      67        63          60        79        81
4  Ellen      91        90         100       100        43
5   Fred      72        31          42        50        55

In [76]:
df.to_csv('consensus.csv') #look in 'coincent ml folder'. It has created what you asked.

In [77]:
df.to_excel('consensus.xlsx')

In [78]:
df.dropna() #check docstring.
df #no values misssing,so none dropped.

   age    name   home city
a   23  alison    new york
b   45    john  california
d   67    dave      london
e   12   stacy       paris
f   30     sam     toronto
g   16     tom   las vegas

In [82]:
df3= pd.read_csv('icecream_missing.csv') #NaN means not-a-number.This is used to indicate missing values.
df3

,flavour,honey,fruit,nuts,sprinkles,chocolate sauce,cherries
0,vanilla,30,45,50.0,32.0,76.0,89.0
1,chocolate,45,65,100.0,NaN,90.0,72.0
2,strawberry,87,64,NaN,NaN,34.0,12.0
3,butterscotch,76,94,2.0,44.0,NaN,NaN
4,black currant,12,77,900.0,54.0,66.0,34.0

In [84]:
df3.dropna()

,flavour,honey,fruit,nuts,sprinkles,chocolate sauce,cherries
0,vanilla,30,45,50.0,32.0,76.0,89.0
4,black currant,12,77,900.0,54.0,66.0,34.0